In [30]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns


from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler, MinMaxScaler, RobustScaler

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import classification_report
from sklearn.metrics import plot_roc_curve

from sklearn.tree import DecisionTreeClassifier
from sklearn.tree import DecisionTreeRegressor

In [7]:
factory = pd.read_csv('Factory_Salary.csv')
factory

,Date,Profession,Rank,Equipment,Insalubrity,Size_Production,Salary
0,2009-01-01,Metal heater,7,Heating furnaces,22,580,26020.000000
1,2009-01-01,Metal heater,6,Heating furnaces,22,580,22980.000000
2,2009-01-01,Metal heater,5,Heating furnaces,22,580,20350.000000
3,2009-01-01,Metal heater,5,Heating furnaces,22,580,20350.000000
4,2009-01-01,Metal heater,4,Heating furnaces,22,580,18090.000000
...,...,...,...,...,...,...,...
259,2009-08-01,Quality controller,7,Control and measuring equipment,0,1180,26342.235294
260,2009-09-01,Quality controller,7,Control and measuring equipment,0,1080,25044.588235
261,2009-10-01,Quality controller,7,Control and measuring equipment,0,780,22060.000000
262,2009-11-01,Quality controller,7,Control and measuring equipment,0,1020,24266.000000
263,2009-12-01,Quality controller,7,Control and measuring equipment,0,810,22060.000000

In [9]:
factory.head(5)

,Date,Profession,Rank,Equipment,Insalubrity,Size_Production,Salary
0,2009-01-01,Metal heater,7,Heating furnaces,22,580,26020.0
1,2009-01-01,Metal heater,6,Heating furnaces,22,580,22980.0
2,2009-01-01,Metal heater,5,Heating furnaces,22,580,20350.0
3,2009-01-01,Metal heater,5,Heating furnaces,22,580,20350.0
4,2009-01-01,Metal heater,4,Heating furnaces,22,580,18090.0

In [11]:
factory.shape

(264, 7)

In [21]:
factory.describe()

             Rank  Insalubrity  Size_Production        Salary
count  264.000000   264.000000       264.000000    264.000000
mean     4.909091    15.681818       988.333333  21030.461230
std      1.313600     6.682726       231.372715   4323.920780
min      3.000000     0.000000       580.000000  12180.000000
25%      4.000000    11.000000       805.000000  17830.000000
50%      5.000000    18.000000       985.000000  20350.000000
75%      6.000000    22.000000      1185.000000  23818.014706
max      7.000000    22.000000      1400.000000  33157.058824

In [ ]:
## In this data "churn" will be considered as target and remaining cols apart from "customer_id" will be considered as 
## features to predict that customer will renew the policy or not. That means it is a supervided classifictaion 
## problem and it can be solved by decision tree or any linear based model like logistic regression model...
churn.columns

## EDA

In [12]:
factory.dtypes

Date                object
Profession          object
Rank                 int64
Equipment           object
Insalubrity          int64
Size_Production      int64
Salary             float64
dtype: object

In [13]:
## after importing the data we have to some EDA like missin value check and data standarization :

factory.info(null_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             264 non-null    object
 1   Profession       264 non-null    object
 2   Rank             264 non-null    int64
 3   Equipment        264 non-null    object
 4   Insalubrity      264 non-null    int64
 5   Size_Production  264 non-null    int64
 6   Salary           264 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 14.6+ KB

C:\Users\Samsung\AppData\Local\Temp\ipykernel_10124\2565754999.py:3: FutureWarning: null_counts is deprecated. Use show_counts instead
  factory.info(null_counts = True)

In [15]:
factory.columns

Index(['Date', 'Profession', 'Rank', 'Equipment', 'Insalubrity',
       'Size_Production', 'Salary'],
      dtype='object')

In [23]:
## i have devided into numeric and obj data
## then done standardisation on num features
## label encoding on obj features
## concat both the datasets:


num = factory.select_dtypes(include = np.number)
obj = factory.select_dtypes(include = np.object)

from sklearn.preprocessing import StandardScaler
feature_scaler = StandardScaler()
num2 = feature_scaler.fit_transform(num)
num2 = pd.DataFrame(num2,columns= num.columns)

from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

obj2 = obj.apply(le.fit_transform)
obj2.head(2)

factory2 = pd.concat([num2,obj2],axis =1)
print(factory.shape)
print(factory2.shape)

(264, 7)
(264, 7)

C:\Users\Samsung\AppData\Local\Temp\ipykernel_10124\2365645232.py:8: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  obj = factory.select_dtypes(include = np.object)

In [24]:
factory2.head(5)

,Rank,Insalubrity,Size_Production,Salary,Date,Profession,Equipment
0,1.594763,0.947245,-1.768181,1.156130,0,2,2
1,0.832050,0.947245,-1.768181,0.451729,0,2,2
2,0.069338,0.947245,-1.768181,-0.157670,0,2,2
3,0.069338,0.947245,-1.768181,-0.157670,0,2,2
4,-0.693375,0.947245,-1.768181,-0.681337,0,2,2

In [25]:
factory2.columns

Index(['Rank', 'Insalubrity', 'Size_Production', 'Salary', 'Date',
       'Profession', 'Equipment'],
      dtype='object')

In [26]:
x = factory2[['Rank', 'Insalubrity', 'Size_Production','Profession', 'Equipment']]
y = factory2['Salary']

In [27]:
from sklearn.metrics import mean_squared_error,r2_score
#from sklearn.feature_selection import RFE

#rfe = RFE(DecisionTreeRegressor(),n_features_to_select=3)

In [28]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.20)

In [31]:
model = DecisionTreeRegressor()
model.fit(x_train,y_train)

DecisionTreeRegressor()

In [32]:
pred = model.predict(x_test)

In [33]:
print(mean_squared_error(y_test,pred))
print(r2_score(y_test,pred))

0.002720415353927897
0.995076239177985